app/views/postsby/index.html.erb

SELECT COUNT(*) FROM `posts` WHERE `posts`.`user_id` = 8
---
                                <div class="level-item">
                                <span>No of Posts :: <strong class="tag is-rounded"><%= user.posts.count%> </strong></span>