app/views/postsby/show.html.erb

                            <div class="level-right">
                                <span class="level-item tag">No of Comments :: <strong class="is-rounded"><%= post.comments.count%> </strong></span>
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 24