app/views/posts/index.html.erb

                                            <p class="level-item">
                                            <span class="tag is-rounded"><strong><%= post.comments.count%></strong>Comments</span>
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 28