app/views/posts/show.html.erb

SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 28
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 15
---
<div class="container">
    <h2 class="subtitle is-5"><strong><%= @post.comments.count %></strong> Comments</h5>