app/controllers/comments_controller.rb

    def create
        @post = Post.find(params[:post_id])
        print "in create ---"
        @comment = current_user.comments.create(params[:comment].permit(:name,:comment,:post_id))
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`name`, `comment`, `created_at`, `updated_at`, `post_id`, `user_id`) VALUES ('sdf', 'sdf', '2020-01-29 11:28:28', '2020-01-29 11:28:28', 7, 1)

    def destroy
        @post = Post.find(params[:post_id])
        @comment = @post.comments.find(params[:id])
        @comment.destroy
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 7 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`post_id` = 7 AND `comments`.`id` = 9 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 9