app/controllers/postsby_controller.rb

    def index
        @users = User.all.order("created_at DESC")
---
SELECT `users`.* FROM `users` ORDER BY created_at DESC

    def show
        @user = User.find(params[:id])
        @posts = @user.posts.all.order("created_at DESC")
        @comments = @user.comments.all.order("created_at DESC")
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 0 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 6 ORDER BY created_at DESC
SELECT `comments`.* FROM `comments` WHERE `comments`.`user_id` = 7 ORDER BY created_at DESC