app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY created_at DESC
---
    def index
        @posts = Post.all.order("created_at DESC")

INSERT INTO `posts` (`title`, `content`, `created_at`, `updated_at`, `user_id`) VALUES ('new post', 'lkdjsfs', '2020-01-29 08:50:07', '2020-01-29 08:50:07', 1)
---
    def create
        @post = current_user.posts.build(post_params)
        if @post.save

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
UPDATE `posts` SET `content` = '2nd comment!!', `updated_at` = '2020-01-27 06:42:23' WHERE `posts`.`id` = 2
---
    def update
        @post = Post.find(params[:id])

        if @post.update(post_params)